<?php

return [

/*
|--------------------------------------------------------------------------
| Alert Language Lines
|--------------------------------------------------------------------------
|
| The following language lines contain alert messages for various scenarios
| during CRUD operations. You are free to modify these language lines
| according to your application's requirements.
|
*/

'backend' =>[
'users' =>[
'cant_resend_confirmation'  => 'تتوجب موافقة الادارة على هذه العملية ، انتظروا نتائج الفحص من فضلكم ',
'confirmation_email'  => 'لقد ارسلنا ايميل تأكيد لبريدكم الالكتروني ، تحققوا من بريدكم الالكتروني من فضلكم ',
'confirmed'  => 'تم التحقق من حساب المستخدم بنجاح',
'created'  => 'تم انشاء حساب المستخدم بنجاح',
'deleted'  => 'تم حذف حساب المستخدم بنجاح',
'deleted_permanently'  => 'تم  حذف حساب المستخدم كليا',
'restored'  => 'تمت استعادة حساب المستخدم ',
'session_cleared'  => 'تم تسجيل خروج المستخدم ',
'social_deleted'  => 'تم ازالة حساب التواصل الاجتماعي بنجاح',
'unconfirmed'  => 'لم يتم التحقق من حساب المستخدم بعد',
'updated'  => 'تم تحديث معلومات المستخدم بنجاح',
'updated_password'  => 'تم تحديث كلمة المرور بنجاح',
],
'brokers' =>[
'cant_resend_confirmation'  => 'تتوجب موافقة الادراة على هذه العملية ، انتظروا نتائج الفحص من فضلكم ',
'confirmation_email'  => 'لقد ارسلنا ايميل تأكيد لبريدكم الالكتروني ، تحققوا من بريدكم الالكتروني من فضلكم ',
'confirmed'  => 'تم التأكد من حساب الوكيل العقاري بنجاح',
'created'  => 'تم انشاء حساب الوكيل العقاري بنجاح',
'deleted'  => 'تم حذف حساب الوكيل العقاري بنجاح',
'deleted_permanently'  => 'تم حذف حساب الوكيل العقاري كليا',
'restored'  => 'تمت استعادة حساب الوكيل العقاري',
'session_cleared'  => 'تم تسجيل خروج الوكيل العقاري ',
'social_deleted'  => 'تم إزالة حساب التواصل الاجتماعي بنجاح',
'unconfirmed'  => 'لم يتم التحقق من حساب الوكيل العقاري بعد',
'updated'  => 'تم تحديث حساب الوكيل العقاري بنجاح',
'updated_password'  => 'تم تحديث كلمة المرور الخاصة بالوكيل العقاري بنجاح',
],
],

'frontend' =>[
'contact' =>[
    'sent'  => 'لقد استلمنا المعلومات التي تم ارسالها من قبلكم ، سنفعل مابوسعنا ليتم الرد عليكم في اقصر وقت ممكن ',
],
'reportbroker' =>[
    'sent'  => 'لقد استلمنا المعلومات التي تم ارسالها من قبلكم ، سنفعل مابوسعنا لفعل اللازم  في اقصر وقت ممكن ',
],
],

'general' =>[
'property_drafted'  => 'تمت إضافة الخاصية كمسودة',
'property_created'  => 'تم انشاء الاعلان بنجاح',
'property_created_against_property_request'  => ':property_request_label مقابل طلب انشاء الاعلان و بسبب إنشاء:property_request_label تم حل الموضوع',
'property_updated'  => 'تم تحديث الاعلان بنجاح',
'property_deleted'  => 'تم حذف الاعلان بنجاح',
'property_error_contract_not_confirmed'  => 'لا يمكنكم إنشاء إعلان دون وصول الينا عقد تعاون العمل المطلوب توقيعه منكم ',
'property_error_commission_not_defined'  => 'لا يمكنك الإعلان بدون تحديد أسعار العمولات التي تجمعها',
'property_limit_reached'  => 'لقد وصلتم الى الحد الاقصى لاضافة الاعلانات التي وضحتها شركتكم ، لا تستطيعوا اضافة اعلان زائد على العدد الموضح',
'settings_saved_with_file_error'  => 'تم تسجيل إعداداتك بنجاح ، ولكن حدثت مشكلة في تحميل العقد ، يرجى المحاولة مرة أخرى في وقت لاحق',
'property_type_created'  => 'تم حفظ نوع العقار بنجاح',
'property_type_updated'  => 'تم تحديث نوع العقار بنجاح',
'property_type_deleted'  => 'تم حذف نوع العقار بنجاح ',
'city_created'  => 'تم انشاء المدينة بنجاح ',
'city_updated'  => 'تم تحديث المدينة بنجاح ',
'city_deleted'  => 'تم  حذف المدينة بنجاح ',
'associated_city_cannot_be_deleted'  => 'لا يمكن حذف المدينة التي تم اختيارها بسبب ارتباط بعض المستخدمين/ الوكلاء العقاريين بها . اولا يجب ان يحذف المستخدمين/ الوكلاء العقاريين من تلك المدينة.',
'district_created'  => 'تم انشاء المقاطعة/الحي بنجاح',
'district_updated'  => 'تم تحديث المقاطعة/الحي بنجاح',
'district_deleted'  => 'تم حذف المقاطعة/الحي بنجاح',

'page_created'  => 'تم انشاء الصفحة بنجاح ',
'page_updated'  => 'تم تحديث الصفحة بنجاح',
'page_deleted'  => 'تم حذف الصفحة بنجاح',
'image_removed'  => 'تم حذف الصورة المختارة بنجاح',
'request_in_progress'  => 'تم اخذ طلبكم للعمل عليه ، سيصل اليكم المشروع قريبا ، انتظروا منا الرد ',
]
];






















