<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Exception Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used in Exceptions thrown throughout the system.
    | Regardless where it is placed, a button can be listed here so it is easily
    | found in a intuitive way.
    |
    */

    'backend' =>[
        'access' =>[
            'roles' =>[
                'already_exists'     => 'هذا القسم موجود بالفعل ، اختر اسم قسم اخر من فضلك',
                'cant_delete_admin'  => 'لا يمكنكم حذف قسم المدير',
                'create_error'       => 'عند انشاء هذا القسم حدث خطأ ، نرجو المحاولة لاحقا ',
                'delete_error'       => 'عند حذف هذا القسم حدث خطأ ، نرجو المحاولة لاحقا ',
                'has_users'          => 'لا يمكنكم حذف القسم المتعلق بالمستخدمين ',
                'needs_permission'   => 'عليكم اعطاء على الاقل سلطة عمل لهذا القسم ', 
                'not_found'          => 'لا يوجد قسم بهذه الصفات',
                'update_error'       => 'عند تحديث هذا القسم حدث خطأ ، نرجو المحاولة لاحقا',
            ],

            'users' =>[
                'already_confirmed'     => 'تم بالفعل تأكيد هذا المستخدم',
                'cant_confirm'  => 'عند تأكييد حساب المستخدم حدث خطأ',
                'cant_deactivate_self'   => 'لا يمكنكم جعل حسابكم غير نشط بانفسكم ، اطلبوا ذلك من الادارة',
                'cant_delete_admin'   => 'لا يمكنكم حذف المشرف المتميز ',
                'cant_delete_self'       => 'لا يمكنكم حذف حسابكم ، اطلبوا ذلك من الادارة',
                'cant_delete_own_session'  => 'لا يمكنكم حذف تسجيل دخولكم ',
                'cant_restore'           => 'لا داعي لاستعادة هذا الحساب لانه لم يتم حذفه بعد ',
                'cant_unconfirm_admin'  => 'لا يمكنكم الغاء  المشرف المتميز',
                'cant_unconfirm_self'  => 'لا يمكنكم الغاء انفسكم',
                'create_error'           => 'عند انشاء هذا المستخدم حدث خطأ ، نرجو المحاولة لاحقا',
                'delete_error'           => 'عند حذف هذا المستخدم حدث خطأ ، نرجو المحاولة لاحقا',
                'delete_first'           => 'قبل حذف هذا المستخدم بشكل كلي يجب عمل اجراءات حذف اولية',
                'email_error'            => 'هذا البريد الالكتروني عائد لشخص اخر',
                'mark_error'             => 'عند تحديث معلومات هذا المستخدم حدث خطأ ، نرجو المحاولة لاحقا',
                'not_confirmed'             => 'لم يتم تأكيد حساب هذا المستخدم بعد',
                'not_found'              => 'لايوجد مستخدم كهذا',
                'restore_error'          => 'عند محاولة استعادة حساب المستخدم هذا حدث خطأ ، نرجو المحاولة لاحقا',
                'role_needed_create'     => 'عليكم اختيار قسم واحد على الاقل',
                'role_needed'            => 'عليكم اختيار قسم واحد على الاقل',
                'session_wrong_driver'   => 'يجب ضبط برنامج التشغيل كقاعدة بيانات لاستخدام هذه الخاصية ',
                'social_delete_error'  => 'عند ازالة الحساب الاجتماعي حدث خطأ ، نرجو المحاولة لاحقا',
                'update_error'           => 'عند تحديث هذا الحساب حدث خطأ ، نرجو المحاولة لاحقا',
                'update_password_error'  => 'عند العمل على تغيير كلمة مرور هذا الحساب حدث خطأ ، نرجو المحاولة لاحقا',
            ],
        ],
    ],

    'frontend' =>[
        'auth' =>[
            'confirmation' =>[
                'already_confirmed'  => 'تم بالفعل تأكييد هذا الحساب',
                'created'            => 'تم انشاء حساب',
                'confirm'            => 'يجب توثيق حسابكم ',
                'created_confirm'    => 'تم انشاء حسابكم بنجاح ، تم ارسال رسالة تأكييد لكم ',
                'created_pending'    => 'لقد تم انشاء حسابكم بنجاح ولكن مازال الفحص مستمرا من قبل الادارة ، عند الانتهاء من العمل سيتم ارسال رسالة تأكييد اليكم',
                'mismatch'           => 'تم ادخال كود التصحيح بشكل خاطيء ، تحققوا من ذلك',
                'not_found'          => 'لم نرسل كود تصحيح كهذا ، لقد قمتم بتفليقه',
                'pending'             => 'فحصنا مستمر ، تستطيعون تسجيل دخولكم بعد الانتهاء من هذا العمل ، سيتم ارسال رسالة بريد الكتروني اليكم عند الانتهاء',
                'resend'             => 'لم يتم توثيق حسابكم بعد ، للتوثيق نرجو الضغط على الرابط الذي تم ارساله اليكم على البريد الالكتروني او لارسال رسالة توثيق جديدة اضغط هنا <a href="'.route('frontend.auth.account.confirm.resend', ':user_uuid').'">',
                'success'            => 'تم توثيق حسابكم بنجاح',
                'resent'             => 'تم ارسال رسالة توثيق جديدة الى بريدكم الالكتروني ',
            ],

            'deactivated'  => 'تم تعليق حسابكم ',
            'email_taken'  => 'هذا العنوان الالكتروني مستخدم بالفعل',

            'password' =>[
                'change_mismatch'  => 'هذه ليست كلمة المرور القديمة الخاصة بكم ',
                'reset_problem'  => 'عند تعيين كلمة المرور حدث خطأ ، نرجو طلب التعيين مجددا عبر البريد الالكتروني ',
            ],

            'registration_disabled'  => 'لا نقبل تسجيل جديد حاليا ',
        ],
    ],
];
