<?php

return [

    /*
    |--------------------------------------------------------------------------
    | HTTP Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used in the views/errors files.
    |
    */

    '404' =>[
        'title'        => 'نتأسف ، لا تتواجد الصفحة المطلوبة ، يمكنكم الاطلاع على اعلاناتنا الاخرى للحصول على المنزل الذي تحلمون به',
        'description'  => 'نتأسف ، الصفحة التي رغبتم بها ليست موجودة في النظام ، ولكن يمكنكم الاطلاع على اعلاناتنا الاخرى للحصول على المنزل الذي تحلمون به',
    ],

    '503' =>[
        'title'        => 'الى اللقاء قريبا ',
        'description'  => 'نعمل على اصلاح الاخطاء التقنية ، الى اللقاء قريبا ',
    ],
];
