<?php

return [

/*
|--------------------------------------------------------------------------
| Alert Language Lines
|--------------------------------------------------------------------------
|
| The following language lines contain alert messages for various scenarios
| during CRUD operations. You are free to modify these language lines
| according to your application's requirements.
|
*/

'backend' =>[
'users' =>[
'cant_resend_confirmation'  => 'Для этого действия требуется одобрение руководства, пожалуйста, дождитесь результатов рассмотрения запроса',
'confirmation_email'  => 'Мы отправили вам электронное письмо с подтверждением на зарегистрированный у нас адрес электронной почты, пожалуйста, проверьте свою учетную запись вашей электронной почты',
'confirmed'  => 'Учетная запись пользователя успешно подтверждена',
'created'  => 'Учетная запись пользователя успешно создана',
'deleted'  => 'Учетная запись пользователя успешно удалена',
'deleted_permanently'  => 'Учетная запись пользователя полностью удалена ',
'restored'  => 'Учетная запись пользователя восстановлена​​',
'session_cleared'  => 'Выполнен выход пользователя из системы',
'social_deleted'  => 'Успешно удалена учетная запись в социальных сетях',
'unconfirmed'  => 'Учетная запись пользователя еще не Подтверждена',
'updated'  => 'Успешно обновлена пользовательская информация​',
'updated_password'  => 'Пароль успешно обновлен',
],
'brokers' =>[
'cant_resend_confirmation'  => 'Для этого действия требуется одобрение руководства, пожалуйста, дождитесь результатов рассмотрения запроса',
'confirmation_email'  => 'Мы отправили вам электронное письмо с подтверждением на зарегистрированный у нас адрес электронной почты, пожалуйста, проверьте свою учетную запись вашей электронной почты',
'confirmed'  => 'Учетная запись риэлтора успешно подтверждена',
'created'  => 'Учетная запись риэлтора успешно создана',
'deleted'  => 'Учетная запись риэлтора успешно удалена',
'deleted_permanently'  => 'Учетная запись риэлтора полностью удалена',
'restored'  => 'Учетная запись риэлтора восстановлена​​',
'session_cleared'  => 'Выполнен выход риэлтора из системы',
'social_deleted'  => 'Успешно удалена учетная запись в социальных сетях',
'unconfirmed'  => 'Учетная запись риэлтора еще не Подтверждена',
'updated'  => 'Успешно обновлена учетная запись риэлтора​',
'updated_password'  => 'Пароль риэлтора успешно обновлен',
],
],

'frontend' =>[
    'contact' =>[
        'sent'  => 'Мы получили отправленную вами информацию и сделаем все возможное, для того, чтобы ответить вам в кратчайшие сроки',
    ],
    'reportbroker' =>[
        'sent'  => 'Мы получили отправленную вами информацию и сделаем все возможное, для того, чтобы ответить вам в кратчайшие сроки',
    ],
],

'general' =>[
'property_drafted'  => 'Свойство успешно добавлен в проект',
'property_created'  => 'Объявление было успешно создано',
'property_created_against_property_request'  => 'В связи с тем, что объявление : property_request_label было создано вместо объявления :property_label, тема закрыта. ',
'property_updated'  => 'Объявление успешно обновлено',
'property_deleted'  => 'Объявление успешно удалено',
'property_error_contract_not_confirmed'  => 'Вы не можете создать объявление до тех пор, пока к нам не поступит договор о сотрудничестве, который вам нужно подписать',
'property_error_commission_not_defined'  => 'Вы не можете создать объявление, не указав комиссионные ставки за недвижимость,',
'property_limit_reached'  => 'Вы достигли лимита на объявления, определенные для вашей компании, в связи с чем, вы не можете размещать объявления сверх лимита.',
'settings_saved_with_file_error'  => 'Ваши настройки были успешно сохранены, но возникла проблема с загрузкой договора. Повторите попытку позже.',
'property_type_created'  => 'Тип недвижимости был успешно зарегистрирован',
'property_type_updated'  => 'Тип недвижимости успешно обновлен',
'property_type_deleted'  => 'Тип недвижимости успешно удалён',
'city_created'  => 'Город успешно создан',
'city_updated'  => 'Город успешно обновлен',
'city_deleted'  => 'Город успешно удален',
'associated_city_cannot_be_deleted'  => 'Выбранный город нельзя удалить, поскольку к нему привязано несколько пользователей/риэлторов. Прежде всего, необходимо удалить пользователей/ риэлторов в этом городе',
'district_created'  => 'Район/квартал успешно создан',
'district_updated'  => 'Район/квартал успешно обновлен',
'district_deleted'  => 'Район/квартал успешно удален',

'page_created'  => 'Страница успешно создана',
'page_updated'  => 'Страница успешно обновлена​​',
'page_deleted'  => 'Страница успешно удалена',
'image_removed'  => 'Выбранное изображение успешно удалено ',
'request_in_progress'  => 'Ваш запрос обрабатывается, в ближайшее время вам будет направлена счет-фактура, пожалуйста, дождитесь нашего ответа',
],
];





















