<?php

return [

    /*
    |--------------------------------------------------------------------------
    | HTTP Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used in the views/errors files.
    |
    */

    '404' =>[
        'title'        => 'Извините, запрашиваемая вами страница, не найдена. Возможно, вы захотите посмотреть другие наши объявления, чтобы найти дом вашей мечты',
        'description'  => 'К сожалению, страница, которую вы хотите открыть, недоступна в системе. Возможно, вы захотите посмотреть другие наши объявления, чтобы найти дом вашей мечты',
    ],

    '503' =>[
        'title'        => 'До скорой встречи',
        'description'  => 'Мы пытаемся решить технические проблемы, до скорой встречи',
    ],
];
